dotcortex.org
#+TITLE: DotCortex: Declarative, Literate & Reproducible
#+DESCRIPTION: DotCortex utilities (health, backup)
#+AUTHOR: Mètsàtron — Sovereign Weaver
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent :comments both
#+PROPERTY: header-args:text :comments no
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Intent

** DotCortex symlink health scanner
#+BEGIN_SRC bash :tangle linux/.local/bin/dotcortex-stow-health :shebang "#!/usr/bin/env bash" :mkdirp yes
#!/usr/bin/env bash
set -euo pipefail

ROOT="${HOME}"
DOT="${HOME}/DotCortex"
mode="scan"

if [[ "${1-}" == "--fix-stow" ]]; then
  mode="fix-stow"
fi

printf 'DotCortex symlink health - mode: %s\n\n' "$mode"

# Find broken symlinks under $HOME, but ignore Wine and similar
while IFS= read -r -d '' link; do
  target="$(readlink "$link" 2>/dev/null || printf '?')"
  printf 'BROKEN: %s -> %s\n' "$link" "$target"

  if [[ "$mode" == "fix-stow" && "$target" == "$DOT"* ]]; then
    echo "  removing stow symlink: $link"
    rm -v -- "$link"
  fi
done < <(
  find "$ROOT" -xtype l \
    ! -path "$HOME/.wine/*" \
    ! -path "$HOME/.PlayOnLinux/*" \
    -print0
)
#+END_SRC

** DotCortex backup - mirror DotCortex to a target
#+BEGIN_SRC bash :tangle linux/.local/bin/dotcortex-backup-dotfiles :shebang "#!/usr/bin/env bash" :mkdirp yes
#!/usr/bin/env bash
set -euo pipefail

SRC="$HOME/DotCortex"

if [[ ! -d "$SRC" ]]; then
  echo "Source repo not found at $SRC" >&2
  exit 1
fi

DEST_ROOT="${1-}"
if [[ -z "$DEST_ROOT" ]]; then
  echo "Usage: dotcortex-backup-dotfiles /path/to/backup-root" >&2
  exit 1
fi

DEST_ROOT="${DEST_ROOT%/}"
DEST="${DEST_ROOT}/DotCortex"

mkdir -p "$DEST_ROOT"

echo "Mirroring $SRC -> $DEST"
rsync -avh --delete "$SRC"/ "$DEST"/
#+END_SRC

