linux/.local/bin/dotcortex-stow-health
#!/usr/bin/env bash
# DotCortex symlink health scanner

# [[file:../../../dotcortex.org::*DotCortex symlink health scanner][DotCortex symlink health scanner:1]]
#!/usr/bin/env bash
set -euo pipefail

ROOT="${HOME}"
DOT="${HOME}/DotCortex"
mode="scan"

if [[ "${1-}" == "--fix-stow" ]]; then
  mode="fix-stow"
fi

printf 'DotCortex symlink health - mode: %s\n\n' "$mode"

# Find broken symlinks under $HOME, but ignore Wine and similar
while IFS= read -r -d '' link; do
  target="$(readlink "$link" 2>/dev/null || printf '?')"
  printf 'BROKEN: %s -> %s\n' "$link" "$target"

  if [[ "$mode" == "fix-stow" && "$target" == "$DOT"* ]]; then
    echo "  removing stow symlink: $link"
    rm -v -- "$link"
  fi
done < <(
  find "$ROOT" -xtype l \
    ! -path "$HOME/.wine/*" \
    ! -path "$HOME/.PlayOnLinux/*" \
    -print0
)
# DotCortex symlink health scanner:1 ends here
